# YOLOv11n model configuration

# Number of classes
nc: 16

# Names of the classes (optional, useful for visualization)
names:
  - bike
  - bus
  - caravan
  - coupe
  - crossover
  - hatchback
  - jeep
  - mpv
  - pickup-truck
  - sedan
  - suv
  - taxi
  - truck
  - van
  - vehicle
  - wagon

# Scaling factors
depth_multiple: 0.33
width_multiple: 0.25

# Backbone
backbone:
  [
    [-1, 1, Conv, [64, 3, 2]],        # 0-P1/2
    [-1, 1, Conv, [128, 3, 2]],       # 1-P2/4
    [-1, 3, C2f, [128]],
    [-1, 1, Conv, [256, 3, 2]],       # 3-P3/8
    [-1, 6, C2f, [256]],
    [-1, 1, Conv, [512, 3, 2]],       # 5-P4/16
    [-1, 6, C2f, [512]],
    [-1, 1, Conv, [1024, 3, 2]],      # 7-P5/32
    [-1, 3, C2f, [1024]],
    [-1, 1, SPPF, [1024, 5]],
  ]

# Head
head:
  [
    [-1, 1, Conv, [256, 1, 1]],
    [-1, 1, nn.Upsample, ["nearest", 2]],
    [[-1, 6], 1, Concat, [1]],
    [-1, 3, C2f, [256]],

    [-1, 1, Conv, [128, 1, 1]],
    [-1, 1, nn.Upsample, ["nearest", 2]],
    [[-1, 4], 1, Concat, [1]],
    [-1, 3, C2f, [128]],

    [-1, 1, Conv, [128, 3, 2]],
    [[-1, 14], 1, Concat, [1]],
    [-1, 3, C2f, [256]],

    [-1, 1, Conv, [256, 3, 2]],
    [[-1, 10], 1, Concat, [1]],
    [-1, 3, C2f, [512]],

    [[13, 17, 21], 1, Detect, [nc]],
  ]
